Обработки/Reports/_ДоходыПоЦеннымБумагамДругихЭмитентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ДоходыПоЦеннымБумагамДругихЭмитентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ДоходыПоЦеннымБумагамДругихЭмитентов/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Доходы по ценным бумагам других эмитентов (Форма 1-ЦБ раздел 3.2)",
		"0.10",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	УстановитьПривилегированныйРежим(Истина);
	
	// Заполняем параметры	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ПеречниОбъектовСрезПоследних.Период) КАК Период
		|ИЗ
		|	РегистрСведений.ПеречниОбъектов.СрезПоследних(
		|			&Период,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
		|				И ВидПеречня.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ПереченьОрганизацийФинансовогоСектора)) КАК ПеречниОбъектовСрезПоследних");
	Запрос.УстановитьПараметр("Период", КонецДня(ЭтотОбъект.Период) + 1);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ДатаПеречняФинОрганизаций = '00010101';		
	Иначе
		ДатаПеречняФинОрганизаций = РезультатЗапроса.Выгрузить()[0].Период;
	КонецЕсли;
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "НомерДоговора, ДатаЗаключения");	
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоГода(ЭтотОбъект.Период));
	ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(ЭтотОбъект.Период));
	ПараметрыДанных.УстановитьЗначениеПараметра("Период", Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	ПараметрыДанных.УстановитьЗначениеПараметра("ДатаПеречняФинОрганизаций", ДатаПеречняФинОрганизаций);
	ПараметрыДанных.УстановитьЗначениеПараметра("ПредставлениеПериода", ПредставлениеПериода(ПараметрыДанных.Элементы.Найти("НачалоПериода").Значение, ПараметрыДанных.Элементы.Найти("КонецПериода").Значение, "ФП = Истина"));
	ПараметрыДанных.УстановитьЗначениеПараметра("ПредставлениеДоговора", РеквизитыДоговора.НомерДоговора + " от " + Формат(РеквизитыДоговора.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
	
	// Формируем отчет
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка); 	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
